console.log(`%cCV#3. CV. Cross-Check`, 'font-weight: bold; font-size: 18px');

console.log(`Task: https://github.com/rolling-scopes-school/tasks/blob/master/tasks/cv/cv-stage0.md\n\n`);

console.log(`%cСамооценка:`, 'font-weight: bold;');

console.log(`
  Выполнены все пункты задания.

  ✔️ 1. Студент засабмитил в rs app ссылку на своё CV, задеплоенное на gh-pages: +10

  ✔️ 2. Вёрстка валидная: +10

  ✔️ 3. Вёрстка семантическая: +20
  \tВ коде странице присутствуют и используются по назначению следующие элементы:
  \t\t🗹 header, main, footer: +5
  \t\t🗹 элемент nav: +5
  \t\t🗹 только один заголовок h1: +5
  \t\t🗹 заголовки h2: +5

  ✔️ 4. В footer есть ссылка на гитхаб автора работы, год создания приложения, логотип курса со ссылкой на курс: +10

  ✔️ 5. Для оформления СV используются css-стили: +10

  ✔️ 6. При уменьшении масштаба страницы браузера вёрстка размещается по центру по горизонтали, а не сдвигается в сторону: +10
  
  ✔️ 7. на странице СV есть фото или аватарка автора, пропорции изображения не искажены, у изображения есть атрибут alt: +10

  ✔️ 8. Навигация, контакты для связи и перечень навыков оформлены в виде списка ul > li или ul > li > a: +10

  ✔️ 9. Содержание CV: +30
  \tCV содержит:
  \t\t🗹 краткую информацию о себе: +5
  \t\t🗹 контакты для связи: +5
  \t\t🗹 перечень навыков: +5
  \t\t🗹 пример кода. Код добавляется при помощи символов и тегов, а не картинкой: +5
  \t\t🗹 перечень выполненных учебных проектов со ссылками на исходный код или страницу приложения: +5
  \t\t🗹 информацию об образовании и уровне английского: +5

  ✔️ 10. CV выполнено на английском языке: +10

`)

console.log(`%cИтого: 130 баллов из 120`, 'font-weight: bold; font-size: 18px');